benchmarks/batching_results/llama-2-13b/_4__2000/log_11829608.out
WARNING 11-15 16:41:15 _custom_ops.py:19] Failed to import from vllm._C with ModuleNotFoundError("No module named 'vllm._C'")
Namespace(backend='openai', base_url=None, host='localhost', port=14338, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/data/dummy_dataset_mean.json', model='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/llama/llama-2-13b', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=2000, logprobs=None, request_rate=inf, seed=0, trust_remote_code=False, disable_tqdm=True, profile=False, save_result=True, metadata=None, result_dir='benchmarks/testing/llama-2-13b/_4__2000', result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', launch_server=True, server_args='--port=14338 --disable-log-requests --model=/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/llama/llama-2-13b --max-num-seqs=4', launch_server_with_nsight=False, disable_log_stats=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Server started
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
============ Serving Benchmark Result ============
Successful requests:                     2000      
Benchmark duration (s):                  2385.18   
Total input tokens:                      500000    
Total generated tokens:                  462000    
Request throughput (req/s):              0.84      
Output token throughput (tok/s):         193.70    
Total Token throughput (tok/s):          403.32    
---------------Time to First Token----------------
Mean TTFT (ms):                          1191363.75
Median TTFT (ms):                        1191230.45
P99 TTFT (ms):                           2356391.43
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          20.42     
Median TPOT (ms):                        20.39     
P99 TPOT (ms):                           21.03     
---------------Inter-token Latency----------------
Mean ITL (ms):                           20.51     
Median ITL (ms):                         20.48     
P99 ITL (ms):                            21.28     
==================================================
Concurrent checker terminated
Server terminated